 
;-------------------------------------------------------------------------- 
;       Вектор сброса по включении питания 
;--------------------------------------------------------------------------- 
        ORG     0FFF0H 
;-------Сброс по включении питания 
 
        JMP     FAR PTR RESETV 
        DB      '10/07/88'           ;Маркер даты создания версии BIOS 
        DB      0FFH 
        DB      0FFH                 ;Маркер IBM/PC 
;        DB      0FFH 
 
        CODE   ENDS 
