
;------------------------------------------------------------- 
;             Т А Б Л И Ц Ы   Д Л Я   I N T 9 
;------------------------------------------------------------- 
 
 
;      таблица соответствия русских символов скан-кодам 
 
LR      LABEL    BYTE 
        DB       'ЙЦУКЕНГШ' 
        DB       'ЩЗФЫВАПР' 
        DB       'ОЛДЯЧСМИ' 
        DB       'ТЬХЪЖЭЮБ' 
        DB       0f0h           ; 
;-------------------------- 
 
;------- скан-коды управляющих клавиш 
 
K6      LABEL   BYTE 
        DB      RIGHT_KEY 
        DB      LEFT_KEY 
        DB      CTL_KEY 
        DB      ALT_KEY 
        DB      SCROLL_KEY 
        DB      NUM_KEY 
        DB      CAPS_KEY 
        DB      INS_KEY 
K6L     EQU     $-K6 
 
 
;------- перекодировка для CTRL, скан-коды 00-?? 
 
K8      DB      01,55  ;границы интервала 
        DB      27, -1,  0, -1, -1, -1, 30, -1 
        DB      -1, -1, -1, 31, -1,127, -1, 17 
        DB      23,  5, 18, 20, 25, 21,  9, 15 
        DB      16, 27, 29, 10, -1,  1, 19,  4 
        DB       6,  7,  8, 10, 11, 12, -1, -1 
        DB      -1, -1, 28, 26, 24,  3, 22,  2 
        DB      14, 13, -1, -1, -1, -1, 114+80H 
;-------------------------- 
;------- перекодировка для CTRL, дополнительная клавиатура 
;            ( скан-коды ??-?? ) 
 
K9      LABEL   BYTE 
        DB      71,81 ;границы интервала 
        DB      119+80H,-1,     -2,-1,115+80H,-1 
        DB      116+80H,-1,117+80H,-1,118+80H 
 
;-------- перекодировка для верхнего регистра, скан-коды 00-??  (без SHIFT) 
 
K10     LABEL   BYTE 
        DB      1,55 
        DB      01BH,'1234567890-=',08H,09H 
        DB      'qwertyuiop[]',0DH,-1,'asdfghjkl;',027H 
        DB      60H,-1,5CH,'zxcvbnm,./',-1,'*' 
;-------------------------- 
;-------- перекодировка для нижнего регистра, скан-коды 00-??   (c SHIFT) 
 
K11     LABEL   BYTE 
        DB      1,55  ;границы интервала 
        DB      27,'!@#$',37,05EH,'&*()_+',08H,15+80H 
        DB      'qwertyuiop',7BH,7DH,0DH,-1,'asdfghjkl:"' 
        DB      07EH,-1,7CH,'zxcvbnm<>?',-1,114+80H 
;-------------------------- 
;-------перекодировка символов дополнительной клавивтуры 
;       (цифровой режим, скан-коды ??-??) 
 
K14     LABEL   BYTE 
        DB      71,83 ;границы интервала 
        DB      '789-456+1230.' 
;-------перекодировка символов дополнительной клавивтуры 
;       (управление курсором, скан-коды ??-??) 
 
K15     LABEL   BYTE 
        DB      71,83  ;границы интервала 
        DB      71+80H, 72+80H, 73+80H, '-',    75+80H,    -1, 77+80H 
        DB      '+',     79+80H, 80+80H, 81+80H, 82+80H, 83+80H 
 
;-------------------------- 
 
;------ таблица допустимых интервалов скан-кодов для ALT и RUS 
 
KT_ALT  DB      2, 13  ; 1..+ 
KT_RUS0 DB     16, 25  ; Q..P 
        DB     30, 38  ; A..L 
        DB     44, 50  ; Z..M 
KT_RUS  DB     84, 90  ; X..Б,Е с двумя точками с верху 
 
 
         ORG    0E987H 
 
