;---------------------------------------------------------------------------- 
;   таблица для комплекса "ПОИСК" 
;---------------------------------------------------------------------------- 
;  12.02.88   Батьковский  М.Б. 
;---------------------------------------------------------------------------- 
;          таблица описания матрицы клавиатуры (12*8) 
;      отрицательный код (-1..-0FH) --  ссылка на строку таблицы LN_KEY1 
;- колонки--1----2----3----4----5----6----7----8----9----10---11--12- 
LINE1  DB  55H, 4CH, 00H, 56H, 35H, 1CH, 48H, 50H,-0CH, 18H,-0BH,57H 
LINE2  DB -0FH, 4BH, 52H, 41H,-0DH, 0EH, 47H, 4FH, -2H, -3H, 19H,54H 
LINE3  DB  21H, 49H, 51H, 31H, 20H, 1FH, 2CH, 00H, 32H, 25H, 30H,22H 
LINE4  DB  3DH, 00H, 00H, 40H, 3CH, 3BH, -1H, 01H, -9H,-0AH, 3FH,3EH 
LINE5  DB  12H, 00H, 9DH, 23H, 11H, 10H, 1EH, 3AH, 24H, 17H, 14H,13H 
LINE6  DB 0AAH, 37H,0B8H, 2EH, 2DH,0DCH,0DBH,0AAH, 58H, 59H, 2FH,39H 
LINE7  DB  00H, 45H, 53H, 00H, 27H, 44H, 4EH, 4DH, 26H, 42H, 5AH,43H 
LINE8  DB -06H, 4AH, 0FH, 15H, -7H, 46H, -4H, 2BH, 00H, 16H, -5H,-8H 
;---------------------------------------------------------------------------- 
;  03.02.88 - х-54,ъ-55,ж-56,э-57,ю-58,б-59,е-5A/  новые скан коды 
 
 
         ORG    0E82DH 
 
DB       8FH          ;Это ПОИСК 
 
